import React from "react";
import "./Info.css";

function Info() {
  return (
    <div className="info-container">
      <h1>Προϋποθέσεις συμμετοχής</h1>
      
      <div className="info-box">
        <h2>Ποιοι δικαιούνται να συμμετάσχουν στο «Νταντάδες της γειτονιάς;»</h2>
        <ul>
          <li>Εργαζόμενες και άνεργες μητέρες</li>
          <li>Εργαζόμενοι πατέρες</li>
          <li>Κάθε εργαζόμενο πρόσωπο στο οποίο έχει ανατεθεί η αποκλειστική επιμέλεια βρέφους ή νηπίου</li>
        </ul>
      </div>

      <div className="info-box">
        <h2>Ποια κριτήρια πρέπει να ικανοποιούν;</h2>
        <ul>
          <li>Το ετήσιο ατομικό σας εισόδημα για το 2022 να μην ξεπερνά τα 24.000€</li>
          <li>Nα είστε εργαζόμενος/η ή άνεργη εγγεγραμμένη στη ΔΥΠΑ</li>
          <li>Nα μην βρίσκεστε σε ειδική άδεια ή αναστολή επαγγελματικής δραστηριότητας</li>
          <li>Nα έχετε ανήλικο παιδί 2 μηνών έως 2 ετών και 6 μηνών</li>
          <li>H κατοικία σας να βρίσκεται σε Δήμο που συμμετέχει στην Πιλοτική Δράση</li>
        </ul>
      </div>
    </div>
  );
}

export default Info;
