import React from "react";
import { useNavigate } from "react-router-dom";
import "./Suggestions.css";

function Suggestions() {
    const navigate = useNavigate();

    const nannies = [
        { id: 3,
          name: "Αντώνης Γεωργακόπουλος",
          location: "Καλαμάτα",
          rating: 3.9,
          review_count: 4,
          img: "/nanny3.jpg",
          degree: "Βοηθός Βρεφονηπιοκόμων - ΙΕΚ",
          degreeshort: "Βρεφονηπιοκομία",
          age: 38,
          years_exp: 5,
          info: "Είμαι ο Αντώνης Γεωργακόπουλος, βοηθός βρεφονηπιοκόμων με 5 χρόνια εμπειρίας. Προσφέρω πλήρη απασχόληση σε οικογένειες στην Καλαμάτα και τις γύρω περιοχές. Εξειδικεύομαι στη φροντίδα παιδιών, τη μελέτη μαθημάτων, τη μαγειρική και τις οικιακές εργασίες. Μιλάω Αγγλικά και Ισπανικά, και διαθέτω δίπλωμα οδήγησης για να καλύπτω τις ανάγκες σας με ευελιξία.",
          languages: ["Αγγλικά", "Ισπανικά"],
          extraServices: ["Δίπλωμα οδήγησης", "Μαγειρική", "Μελέτη Μαθημάτων", "Οικιακές Εργασίες"],
          employmentType: "Πλήρης Απασχόληση",
          locationRange: ["Καλαμάτα", "Μεσσήνη", "Πανιπέρι", "Πεταλίδι"],
          parentLocation: true,
          nannyLocation: true,
          availabilityDays: ["Δευ", "Τρι", "Πεμ", "Παρ"],
          availabilityTimes: ["Πρωί", "Μεσημέρι"],
          email: "antonaras_georg1987@gmail.com",
          call: "6908420209",
          review_text: [
            {
              reviewer: "Μαρία Παυλάκου",
              date: "2023-07-18",
              review: "Εξαιρετικός ο Νίκος, είμαστε πολύ χαρούμενοι που συνεργαζόμαστε."
            },
            {
              reviewer: "Εύα Χέλμη",
              date: "2024-04-16",
              review: "Μακάρι να μπορούσα να βάλω 6/5 !"
            },
            {
              reviewer: "Γιάννης Αποστολόπουλος",
              date: "2025-01-11",
              review: "Δυστυχώς η συνεργασία μας δεν κράτησε πολύ για προσωπικούς λόγους αλλά χαρήκαμε για την βοήθεια"
            },
            {
              reviewer: "Αποστολία Καραγιάννη",
              date: "2022-08-22",
              review: "Ο Αντώνης τελικά δεν ήταν η κατάλληλη επιλογή για εμάς"
            }
          ]
        },
        { id: 4,
          name: "Χριστίνα Οικονόμου", 
          location: "Ηλιούπολη", 
          rating: 4.2, 
          review_count: 5, 
          img: "/nanny4.jpg", 
          degree: "Τμήμα Μαιευτικής - ΠΑΔΑ", 
          degreeshort: "Μαιευτική", 
          age: 28, 
          years_exp: 4,
          info: "Είμαι η Χριστίνα Οικονόμου, απόφοιτη του Τμήματος Μαιευτικής του ΠΑΔΑ, και ζω στην Ηλιούπολη. Με εμπνέει η φροντίδα των παιδιών και πιστεύω ότι κάθε παιδί αξίζει ένα ζεστό και ασφαλές περιβάλλον για να αναπτυχθεί. Οι εξαιρετικές κριτικές από γονείς που με εμπιστεύτηκαν με ενθαρρύνουν να δίνω πάντα τον καλύτερό μου εαυτό. Αν χρειάζεστε μια υπεύθυνη και έμπειρη νταντά, θα χαρώ πολύ να συνεργαστούμε!",
          languages: ["Αγγλικά", "Γαλλικά"], 
          extraServices: ["Νοηματική γλώσσα"], 
          employmentType: "Πλήρης Απασχόληση", 
          locationRange: ["Ηλιούπολη", "Αργυρούπολη", "Βύρωνας"],
          parentLocation: false,
          nannyLocation: true,
          availabilityDays: ["Δευ", "Τρι", "Σαβ", "Κυρ"],
          availabilityTimes: ["Πρωί", "Μεσημέρι", "Απόγευμα"],
          email: "xristinakioik1@gmail.com",
          call: "6908755042",
          review_text: [
            {
              reviewer: "Νίκος Φούντας",
              date: "2025-01-15",
              review: "Η Χριστίνα είναι εξαιρετική στη δουλειά της! Τα παιδιά μου την αγάπησαν από την πρώτη στιγμή. Τη συστήνω ανεπιφύλακτα!"
            },
            {
              reviewer: "Βασίλης Παπαδόπουλος",
              date: "2023-06-16",
              review: "Δεν ήταν τελικά αυτό που ψάχναμε, αλλά η Χριστίνα είναι πολύ ευγενική και πρόθυμη."
            },
            {
              reviewer: "Γιάννης Θειόπουλος",
              date: "2022-05-06",
              review: "Η Χριστίνα μας βοήθησε σε μια δύσκολη περίοδο. Επαγγελματίας και με αγάπη για τα παιδιά!"
            },
            {
              reviewer: "Δανάη Καλαντζή",
              date: "2024-03-10",
              review: "Ευχαριστουμε Χριστίνα <333"
            },
            {
              reviewer: "Μυρτώ Συνολάκη",
              date: "2024-07-30",
              review: "Εξαιρετική η Χριστίνα, την συστήνουμε ανεπιφύλακτα "
            },
          ]
        },
        { id: 5, 
          name: "Δημήτρης Σπυρόπουλος", 
          location: "Αθήνα", 
          rating: 4.8, 
          review_count: 34, 
          img: "/nanny5.jpg",
          degree: "Ασύγχρονο Πρόγραμμα Εκπαίδευσης",
          degreeshort: "Ασύγχρονο Πρόγραμμα Εκπαίδευσης",
          age: 58,
          years_exp: 20,
          info: "Είμαι ο Δημήτρης Σπυρόπουλος, 58 ετών, με περισσότερα από 20 χρόνια εμπειρίας στη φροντίδα παιδιών. Έχω ολοκληρώσει το Ασύγχρονο Πρόγραμμα Εκπαίδευσης και πιστεύω στην αξία της υπευθυνότητας και της συνέπειας στη δουλειά μου. Με βαθμολογία 4.8/5 από 32 αξιολογήσεις γονέων, νιώθω περήφανος που οι οικογένειες με εμπιστεύονται. Με αγάπη για τα παιδιά και στόχο τη δημιουργία ενός ασφαλούς και υποστηρικτικού περιβάλλοντος, θα χαρώ να σας βοηθήσω με τη φροντίδα των μικρών σας.",
          languages: [], 
          extraServices: ["Ειδικές ανάγκες", "Δίπλωμα οδήγησης"], 
          employmentType: "Πλήρης Απασχόληση", 
          locationRange: ["Αθήνα"],
          parentLocation: true,
          nannyLocation: false,
          availabilityDays: ["Παρ", "Σαβ", "Κυρ"],
          availabilityTimes: ["Πρωί", "Μεσημέρι", "Απόγευμα"],
          email: "dimitris.spiropoulos@yahoo.gr",
          call: "6901237654",
          review_text: [
            {
              reviewer: "Ελένη Σταματίου",
              date: "2023-09-10",
              review: "Ο Δημήτρης ήταν ο άνθρωπος που χρειαζόμασταν. Έχει έναν μοναδικό τρόπο να επικοινωνεί με τα παιδιά, ακόμα και με ιδιαίτερες ανάγκες"
            },
            {
              reviewer: "Μάριος Δεληγιάννης",
              date: "2024-03-15",
              review: "Η εμπειρία και η ηρεμία του Δημήτρη κάνουν τη διαφορά. Τα παιδιά μας τον λατρεύουν, και εμείς είμαστε ήσυχοι ότι βρίσκονται σε καλά χέρια."
            },
            {
              reviewer: "Κωνσταντίνα Αλεξίου",
              date: "2025-01-06",
              review: "Δεν μπορούσαμε να ζητήσουμε καλύτερη φροντίδα για το παιδί μας. Υπεύθυνος, τρυφερός και πάντα στην ώρα του."
            },
            {
              reviewer: "Άννα Παπαδοπούλου",
              date: "2023-11-05",
              review: "Ο Δημήτρης είναι πραγματικά καταπληκτικός με τα παιδιά. Η εμπειρία του φαίνεται σε κάθε του κίνηση. Τον προτείνω ανεπιφύλακτα!"
            },
          ]
        },
        { id: 6, 
          name: "Σοφία Χατζηγεωργίου", 
          location: "Πειραιάς", 
          rating: 4.6, 
          review_count: 27, 
          img: "/nanny6.jpg", 
          degree: "Τμήμα Προσχολικής Αγωγής - ΠΑΔΑ", 
          degreeshort: "Προσχολική Αγωγή", 
          age: 35, 
          years_exp: 8, 
          info: "Υπεύθυνη και έμπειρη, προσφέρω ασφαλή και χαρούμενη απασχόληση για τα παιδιά σας.",
          languages: ["Αγγλικά"], 
          extraServices: ["Κώδικας μπράιγ", "Ειδικές ανάγκες", "Δίπλωμα οδήγησης", "Μαγειρική"], 
          employmentType: "Μερική Απασχόληση", 
          locationRange: ["Πειραιάς", "Νίκαια", "Κερατσίνι"],
          parentLocation: true,
          nannyLocation: true,
          availabilityDays: ["Δευ", "Τρι", "Τετ"],
          availabilityTimes: ["Πρωί", "Μεσημέρι", "Απόγευμα"],
          email: "xatzz.sophia@outlook.com",
          call: "6944554333",
          review_text: [
            {
              reviewer: "Παναγιώτης Καραμάνος",
              date: "2024-05-08",
              review: "Η εμπειρία και η ηρεμία της Σοφίας φαίνονται από την πρώτη στιγμή. Ευχαριστούμε για τη βοήθειά σας!"
            },
            {
              reviewer: "Χρήστος Νικολαΐδης",
              date: "2023-09-15",
              review: "Μια εξαιρετική νταντά που κατανοεί τις ανάγκες των παιδιών και πάντα είναι πρόθυμη να βοηθήσει."
            },
          ]
        },
        { id: 7,
          name: "Κατερίνα Λαμπροπούλου", 
          location: "Γαλάτσι", 
          rating: 4, 
          review_count: 1, 
          img: "/nanny7.jpg",
          degree: "Σχολής Νηπιοβρεφοκόμων του Κέντρου Βρεφών «Η ΜΗΤΕΡΑ»",
          degreeshort: "Βρεφονηπιοκομία",
          age: 21,
          years_exp: 1,
          info: "Είμαι έμπειρη νταντά με σπουδές στη βρεφονηπιοκομία. Λατρεύω να δουλεύω με παιδιά και έχω μία φιλική και στοργική προσέγγιση στη φροντίδα τους. Είμαι διαθέσιμη για βοήθεια με τα μαθήματα καθώς και για ελαφριές οικιακές εργασίες. Μιλάω άπταιστα Αγγλικά, Γαλλικά, Γερμανικά και Ισπανικά.",
          languages: ["Αγγλικά", "Γαλλικά", "Γερμανικά", "Ισπανικά"], 
          extraServices: ["Μελέτη Μαθημάτων", "Οικιακές Εργασίες"], 
          employmentType: "Μερική Απασχόληση", 
          locationRange: ["Γαλάτσι", "Ψυχικό", "Φιλοθέη"],
          parentLocation: false,
          nannyLocation: true,
          availabilityDays: ["Παρ", "Σαβ", "Κυρ"],
          availabilityTimes: ["Πρωί", "Μεσημέρι"],
          email: "katkatxlampr@gmail.com",
          call: "6947030123",
          review_text: [
            {
              reviewer: "Θεοδωρής Ιωάννου",
              date: "2022-04-29",
              review: "Η πιο γλυκιά νταντά!"
            },
          ]
        },
        { id: 8, 
          name: "Παναγιώτης Μιχαηλίδης", 
          location: "Θεσσαλονίκη", 
          rating: 4.2, 
          review_count: 1, 
          img: "/nanny8.jpg", 
          degree: "Ασύγχρονο Πρόγραμμα Εκπαίδευσης", 
          degreeshort: "Ασύγχρονο Πρόγραμμα Εκπαίδευσης", 
          age: 26, 
          years_exp: 2, 
          info: "Είμαι νέος επαγγελματίας με εμπειρία στη φροντίδα και δημιουργική απασχόληση παιδιών. Έχω πτυχίο στα παιδαγωγικά και λατρεύω να διδάσκω και να εμπνέω τα παιδιά. Προσφέρω επιπλέον υπηρεσίες, όπως μαγειρική και βοήθεια με τα μαθήματα, και διαθέτω δίπλωμα οδήγησης για ευκολία στις μετακινήσεις.",
          languages: ["Αγγλικά", "Ισπανικά"], 
          extraServices: ["Δίπλωμα οδήγησης", "Μαγειρική", "Μελέτη Μαθημάτων", "Οικιακές Εργασίες"], 
          employmentType: "Μερική Απασχόληση", 
          locationRange: ["Θεσσαλονίκη", "Εύοσμος"],
          parentLocation: false,
          nannyLocation: true,
          availabilityDays: ["Πεμ", "Παρ", "Σαβ", "Κυρ"],
          availabilityTimes: ["Απόγευμα", "Νύχτα"],
          email: "panagiotis.mixaa98.com",
          call: "6901231231",
          review_text: [
            {
              reviewer: "Βασιλική Χατζή",
              date: "2023-06-01",
              review: "Ο Παναγιώτης χρειάζεται ακόμα εμπειρία αλλά είναι πολύ ευγενικός"
            },
          ]
        },
        {
          id: 9,
          name: "Αλέξανδρος Παπαδόπουλος",
          location: "Θεσσαλονίκη",
          rating: 4.5,
          review_count: 12,
          img: "/nanny9.jpg",
          degree: "Ασύγχρονο Πρόγραμμα Εκπαίδευσης",
          degreeshort: "Ασύγχρονο Πρόγραμμα Εκπαίδευσης",
          age: 29,
          years_exp: 5,
          info: "Είμαι ο Αλέξανδρος Παπαδόπουλος, με 5 χρόνια εμπειρίας στη φροντίδα παιδιών και σπουδές στην Ψυχολογία. Πιστεύω στη σημασία της σωστής καθοδήγησης και του παιχνιδιού για την ανάπτυξη κάθε παιδιού.",
          languages: ["Αγγλικά", "Ιταλικά"],
          extraServices: ["Μαγειρική", "Μελέτη Μαθημάτων"],
          employmentType: "Πλήρης Απασχόληση",
          locationRange: ["Θεσσαλονίκη", "Καλαμαριά", "Ευκαρπία"],
          parentLocation: true,
          nannyLocation: true,
          availabilityDays: ["Δευ", "Τρι", "Τετ", "Πεμ", "Παρ"],
          availabilityTimes: ["Πρωί", "Απόγευμα"],
          email: "alex.papadop@gmail.com",
          call: "6934567890",
          review_text: [
            {
              reviewer: "Ελένη Μαυρίδου",
              date: "2024-09-15",
              review: "Ο Αλέξανδρος είναι εξαιρετικός με τα παιδιά μας. Φαίνεται ότι αγαπά τη δουλειά του και το δείχνει!"
            },
            {
              reviewer: "Μιχάλης Καραγιάννης",
              date: "2024-05-12",
              review: "Με βοήθησε πολύ με τη μελέτη του παιδιού μου. Έχει τρομερή υπομονή και κατανόηση."
            }
          ]
        },
        {
          id: 10,
          name: "Ιωάννα Κωνσταντίνου",
          location: "Πάτρα",
          rating: 4.7,
          review_count: 18,
          img: "/nanny10.jpg",
          degree: "Παιδαγωγικό Τμήμα Δημοτικής Εκπαίδευσης - Πανεπιστήμιο Πατρών",
          degreeshort: "Παιδαγωγικό",
          age: 33,
          years_exp: 7,
          info: "Είμαι η Ιωάννα Κωνσταντίνου, απόφοιτη Παιδαγωγικής, με 7 χρόνια εμπειρίας στη φροντίδα και εκπαίδευση παιδιών. Πιστεύω στη δημιουργική απασχόληση και την ενίσχυση της αυτοπεποίθησης των παιδιών μέσω παιχνιδιού και μάθησης.",
          languages: ["Αγγλικά", "Ιταλικά"],
          extraServices: ["Μαγειρική", "Μελέτη Μαθημάτων", "Δημιουργικές Δραστηριότητες"],
          employmentType: "Μερική Απασχόληση",
          locationRange: ["Πάτρα", "Ρίο", "Βραχνέικα"],
          parentLocation: true,
          nannyLocation: false,
          availabilityDays: ["Δευ", "Τρι", "Πεμ", "Παρ", "Σαβ"],
          availabilityTimes: ["Πρωί", "Μεσημέρι"],
          email: "ioanna.konst@gmail.com",
          call: "6976543210",
          review_text: [
            {
              reviewer: "Αγγελική Δελατόλα",
              date: "2024-10-10",
              review: "Η Ιωάννα είναι πάντα συνεπής και δημιουργική. Τα παιδιά μας την περιμένουν με ανυπομονησία κάθε φορά."
            },
            {
              reviewer: "Δημήτρης Σταυρίδης",
              date: "2023-12-05",
              review: "Πολύ ευγενική και επαγγελματίας. Η βοήθειά της ήταν ανεκτίμητη."
            }
          ]
        }
    ];

    const handleNannyClick = (id) => {
        localStorage.setItem("nannyId", id);
        navigate(`/Goneis/Aggelies/Profile`);
    };

    const handleViewMore = () => {
        navigate('/Goneis/Aggelies'); // Redirect to the page that lists all nannies
    };

    return (
        <div className="suggestions-container">
            <h2 className="search-h2">Δημοφιλείς Νταντάδες</h2>
            <div className="nannies-grid">
                {nannies.map((nanny) => (
                    <div key={nanny.id} className="suggestion-nanny-card" onClick={() => handleNannyClick(nanny.id)}>
                        <img className="avatar" src={nanny.img} alt={nanny.name} />
                        <h3>{nanny.name}</h3>
                        <p>{nanny.location}</p>
                        <p>⭐ {nanny.rating}</p>
                    </div>
                ))}
            </div>
            <button className="view-more-button" onClick={handleViewMore}>
                Προβολή 3260 Νταντάδων
            </button>
        </div>
    );
}

export default Suggestions;
